Sohan-Chitluri/HyprAccel/sdk/src/hyp_esp32_hw.cpp
/*
 * hyp_esp32_hw.cpp
 *
 * ESP32 Hardware Initialization Layer
 * Part of the HyprAccel SDK.
 */

#include <Arduino.h>
#include <SPI.h>
#include <Wire.h>
#include <string.h>
#include "hyprccel.h"
#include "hyp_esp32_hw.h"

#if defined(ARDUINO)
#include "hyp_board_config.h"
#else
#include "../../boards/codegen/hyp_board_config.h"
#endif

/* FW-P5: PWM channel counter for Arduino cores < 3 */
#if ESP_ARDUINO_VERSION_MAJOR < 3
static int next_pwm_channel = 0;
#endif

/* SDK-T6: persistent SPI bus handles so runtime transactions can reuse the
 * peripheral configured in hyp_esp32_hw_init(). These remain NULL until the
 * corresponding bus is initialized; hyp_spi_transfer() treats NULL as
 * "not initialized" rather than failing silently. The captured frequency and
 * mode are applied per-transaction via SPISettings. */
static SPIClass *g_hspi_bus = NULL;
static SPIClass *g_vspi_bus = NULL;
static uint32_t  g_hspi_freq = 1000000;
static uint32_t  g_vspi_freq = 1000000;
static uint8_t   g_hspi_mode = SPI_MODE0;
static uint8_t   g_vspi_mode = SPI_MODE0;

int hyp_esp32_hw_init(void)
{
    Serial.println("[INFO] Initializing ESP32 Hardware...");

    // -------------------------------------------------------------------------
    // 1. GPIO Configuration
    // -------------------------------------------------------------------------
    // Note: Standard C++ preprocessor does not allow #ifdef/#endif inside a macro.
    // Each GPIO pin configuration is written explicitly below.

#ifdef HYP_RESOURCE_GPIO_GPIO0
    {
        int pin = 0; int mode = INPUT; bool is_output = false;
        #ifdef HYP_RESOURCE_GPIO_GPIO0_DIRECTION
            if (strcmp(HYP_RESOURCE_GPIO_GPIO0_DIRECTION, "output") == 0) { mode = OUTPUT; is_output = true; }
        #endif
        #ifdef HYP_RESOURCE_GPIO_GPIO0_PULL
            if (!is_output) {
                if (strcmp(HYP_RESOURCE_GPIO_GPIO0_PULL, "up") == 0 || strcmp(HYP_RESOURCE_GPIO_GPIO0_PULL, "pull-up") == 0) mode = INPUT_PULLUP;
                else if (strcmp(HYP_RESOURCE_GPIO_GPIO0_PULL, "down") == 0 || strcmp(HYP_RESOURCE_GPIO_GPIO0_PULL, "pull-down") == 0) mode = INPUT_PULLDOWN;
            }
        #endif
        pinMode(pin, mode);
        #ifdef HYP_RESOURCE_GPIO_GPIO0_INITIAL_STATE
            if (is_output) digitalWrite(pin, (strcmp(HYP_RESOURCE_GPIO_GPIO0_INITIAL_STATE, "high") == 0 || strcmp(HYP_RESOURCE_GPIO_GPIO0_INITIAL_STATE, "1") == 0) ? HIGH : LOW);
        #endif
    }
#endif

#if defined(HYP_RESOURCE_GPIO_GPIO1) && !defined(HYP_RESOURCE_UART_UART0)
    /* GPIO1 = UART0 TX: only configure as plain GPIO when UART0 is not active. */
    {
        int pin = 1; int mode = INPUT; bool is_output = false;
        #ifdef HYP_RESOURCE_GPIO_GPIO1_DIRECTION
            if (strcmp(HYP_RESOURCE_GPIO_GPIO1_DIRECTION, "output") == 0) { mode = OUTPUT; is_output = true; }
        #endif
        #ifdef HYP_RESOURCE_GPIO_GPIO1_PULL
            if (!is_output) {
                if (strcmp(HYP_RESOURCE_GPIO_GPIO1_PULL, "up") == 0 || strcmp(HYP_RESOURCE_GPIO_GPIO1_PULL, "pull-up") == 0) mode = INPUT_PULLUP;
                else if (strcmp(HYP_RESOURCE_GPIO_GPIO1_PULL, "down") == 0 || strcmp(HYP_RESOURCE_GPIO_GPIO1_PULL, "pull-down") == 0) mode = INPUT_PULLDOWN;
            }
        #endif
        pinMode(pin, mode);
        #ifdef HYP_RESOURCE_GPIO_GPIO1_INITIAL_STATE
            if (is_output) digitalWrite(pin, (strcmp(HYP_RESOURCE_GPIO_GPIO1_INITIAL_STATE, "high") == 0 || strcmp(HYP_RESOURCE_GPIO_GPIO1_INITIAL_STATE, "1") == 0) ? HIGH : LOW);
        #endif
    }
#endif

#ifdef HYP_RESOURCE_GPIO_GPIO2
    {
        int pin = 2; int mode = INPUT; bool is_output = false;
        #ifdef HYP_RESOURCE_GPIO_GPIO2_DIRECTION
            if (strcmp(HYP_RESOURCE_GPIO_GPIO2_DIRECTION, "output") == 0) { mode = OUTPUT; is_output = true; }
        #endif
        #ifdef HYP_RESOURCE_GPIO_GPIO2_PULL
            if (!is_output) {
                if (strcmp(HYP_RESOURCE_GPIO_GPIO2_PULL, "up") == 0 || strcmp(HYP_RESOURCE_GPIO_GPIO2_PULL, "pull-up") == 0) mode = INPUT_PULLUP;
                else if (strcmp(HYP_RESOURCE_GPIO_GPIO2_PULL, "down") == 0 || strcmp(HYP_RESOURCE_GPIO_GPIO2_PULL, "pull-down") == 0) mode = INPUT_PULLDOWN;
            }
        #endif
        pinMode(pin, mode);
        #ifdef HYP_RESOURCE_GPIO_GPIO2_INITIAL_STATE
            if (is_output) digitalWrite(pin, (strcmp(HYP_RESOURCE_GPIO_GPIO2_INITIAL_STATE, "high") == 0 || strcmp(HYP_RESOURCE_GPIO_GPIO2_INITIAL_STATE, "1") == 0) ? HIGH : LOW);
        #endif
    }
#endif

#if defined(HYP_RESOURCE_GPIO_GPIO3) && !defined(HYP_RESOURCE_UART_UART0)
    /* GPIO3 = UART0 RX: only configure as plain GPIO when UART0 is not active. */
    {
        int pin = 3; int mode = INPUT; bool is_output = false;
        #ifdef HYP_RESOURCE_GPIO_GPIO3_DIRECTION
            if (strcmp(HYP_RESOURCE_GPIO_GPIO3_DIRECTION, "output") == 0) { mode = OUTPUT; is_output = true; }
        #endif
        #ifdef HYP_RESOURCE_GPIO_GPIO3_PULL
            if (!is_output) {
                if (strcmp(HYP_RESOURCE_GPIO_GPIO3_PULL, "up") == 0 || strcmp(HYP_RESOURCE_GPIO_GPIO3_PULL, "pull-up") == 0) mode = INPUT_PULLUP;
                else if (strcmp(HYP_RESOURCE_GPIO_GPIO3_PULL, "down") == 0 || strcmp(HYP_RESOURCE_GPIO_GPIO3_PULL, "pull-down") == 0) mode = INPUT_PULLDOWN;
            }
        #endif
        pinMode(pin, mode);
        #ifdef HYP_RESOURCE_GPIO_GPIO3_INITIAL_STATE
            if (is_output) digitalWrite(pin, (strcmp(HYP_RESOURCE_GPIO_GPIO3_INITIAL_STATE, "high") == 0 || strcmp(HYP_RESOURCE_GPIO_GPIO3_INITIAL_STATE, "1") == 0) ? HIGH : LOW);
        #endif
    }
#endif

#ifdef HYP_RESOURCE_GPIO_GPIO4
    {
        int pin = 4; int mode = INPUT; bool is_output = false;
        #ifdef HYP_RESOURCE_GPIO_GPIO4_DIRECTION
            if (strcmp(HYP_RESOURCE_GPIO_GPIO4_DIRECTION, "output") == 0) { mode = OUTPUT; is_output = true; }
        #endif
        #ifdef HYP_RESOURCE_GPIO_GPIO4_PULL
            if (!is_output) {
                if (strcmp(HYP_RESOURCE_GPIO_GPIO4_PULL, "up") == 0 || strcmp(HYP_RESOURCE_GPIO_GPIO4_PULL, "pull-up") == 0) mode = INPUT_PULLUP;
                else if (strcmp(HYP_RESOURCE_GPIO_GPIO4_PULL, "down") == 0 || strcmp(HYP_RESOURCE_GPIO_GPIO4_PULL, "pull-down") == 0) mode = INPUT_PULLDOWN;
            }
        #endif
        pinMode(pin, mode);
        #ifdef HYP_RESOURCE_GPIO_GPIO4_INITIAL_STATE
            if (is_output) digitalWrite(pin, (strcmp(HYP_RESOURCE_GPIO_GPIO4_INITIAL_STATE, "high") == 0 || strcmp(HYP_RESOURCE_GPIO_GPIO4_INITIAL_STATE, "1") == 0) ? HIGH : LOW);
        #endif
    }
#endif

#ifdef HYP_RESOURCE_GPIO_GPIO5
    {
        int pin = 5; int mode = INPUT; bool is_output = false;
        #ifdef HYP_RESOURCE_GPIO_GPIO5_DIRECTION
            if (strcmp(HYP_RESOURCE_GPIO_GPIO5_DIRECTION, "output") == 0) { mode = OUTPUT; is_output = true; }
        #endif
        #ifdef HYP_RESOURCE_GPIO_GPIO5_PULL
            if (!is_output) {
                if (strcmp(HYP_RESOURCE_GPIO_GPIO5_PULL, "up") == 0 || strcmp(HYP_RESOURCE_GPIO_GPIO5_PULL, "pull-up") == 0) mode = INPUT_PULLUP;
                else if (strcmp(HYP_RESOURCE_GPIO_GPIO5_PULL, "down") == 0 || strcmp(HYP_RESOURCE_GPIO_GPIO5_PULL, "pull-down") == 0) mode = INPUT_PULLDOWN;
            }
        #endif
        pinMode(pin, mode);
        #ifdef HYP_RESOURCE_GPIO_GPIO5_INITIAL_STATE
            if (is_output) digitalWrite(pin, (strcmp(HYP_RESOURCE_GPIO_GPIO5_INITIAL_STATE, "high") == 0 || strcmp(HYP_RESOURCE_GPIO_GPIO5_INITIAL_STATE, "1") == 0) ? HIGH : LOW);
        #endif
    }
#endif

#ifdef HYP_RESOURCE_GPIO_GPIO12
    {
        int pin = 12; int mode = INPUT; bool is_output = false;
        #ifdef HYP_RESOURCE_GPIO_GPIO12_DIRECTION
            if (strcmp(HYP_RESOURCE_GPIO_GPIO12_DIRECTION, "output") == 0) { mode = OUTPUT; is_output = true; }
        #endif
        #ifdef HYP_RESOURCE_GPIO_GPIO12_PULL
            if (!is_output) {
                if (strcmp(HYP_RESOURCE_GPIO_GPIO12_PULL, "up") == 0 || strcmp(HYP_RESOURCE_GPIO_GPIO12_PULL, "pull-up") == 0) mode = INPUT_PULLUP;
                else if (strcmp(HYP_RESOURCE_GPIO_GPIO12_PULL, "down") == 0 || strcmp(HYP_RESOURCE_GPIO_GPIO12_PULL, "pull-down") == 0) mode = INPUT_PULLDOWN;
            }
        #endif
        pinMode(pin, mode);
        #ifdef HYP_RESOURCE_GPIO_GPIO12_INITIAL_STATE
            if (is_output) digitalWrite(pin, (strcmp(HYP_RESOURCE_GPIO_GPIO12_INITIAL_STATE, "high") == 0 || strcmp(HYP_RESOURCE_GPIO_GPIO12_INITIAL_STATE, "1") == 0) ? HIGH : LOW);
        #endif
    }
#endif

#ifdef HYP_RESOURCE_GPIO_GPIO13
    {
        int pin = 13; int mode = INPUT; bool is_output = false;
        #ifdef HYP_RESOURCE_GPIO_GPIO13_DIRECTION
            if (strcmp(HYP_RESOURCE_GPIO_GPIO13_DIRECTION, "output") == 0) { mode = OUTPUT; is_output = true; }
        #endif
        #ifdef HYP_RESOURCE_GPIO_GPIO13_PULL
            if (!is_output) {
                if (strcmp(HYP_RESOURCE_GPIO_GPIO13_PULL, "up") == 0 || strcmp(HYP_RESOURCE_GPIO_GPIO13_PULL, "pull-up") == 0) mode = INPUT_PULLUP;
                else if (strcmp(HYP_RESOURCE_GPIO_GPIO13_PULL, "down") == 0 || strcmp(HYP_RESOURCE_GPIO_GPIO13_PULL, "pull-down") == 0) mode = INPUT_PULLDOWN;
            }
        #endif
        pinMode(pin, mode);
        #ifdef HYP_RESOURCE_GPIO_GPIO13_INITIAL_STATE
            if (is_output) digitalWrite(pin, (strcmp(HYP_RESOURCE_GPIO_GPIO13_INITIAL_STATE, "high") == 0 || strcmp(HYP_RESOURCE_GPIO_GPIO13_INITIAL_STATE, "1") == 0) ? HIGH : LOW);
        #endif
    }
#endif

#ifdef HYP_RESOURCE_GPIO_GPIO14
    {
        int pin = 14; int mode = INPUT; bool is_output = false;
        #ifdef HYP_RESOURCE_GPIO_GPIO14_DIRECTION
            if (strcmp(HYP_RESOURCE_GPIO_GPIO14_DIRECTION, "output") == 0) { mode = OUTPUT; is_output = true; }
        #endif
        #ifdef HYP_RESOURCE_GPIO_GPIO14_PULL
            if (!is_output) {
                if (strcmp(HYP_RESOURCE_GPIO_GPIO14_PULL, "up") == 0 || strcmp(HYP_RESOURCE_GPIO_GPIO14_PULL, "pull-up") == 0) mode = INPUT_PULLUP;
                else if (strcmp(HYP_RESOURCE_GPIO_GPIO14_PULL, "down") == 0 || strcmp(HYP_RESOURCE_GPIO_GPIO14_PULL, "pull-down") == 0) mode = INPUT_PULLDOWN;
            }
        #endif
        pinMode(pin, mode);
        #ifdef HYP_RESOURCE_GPIO_GPIO14_INITIAL_STATE
            if (is_output) digitalWrite(pin, (strcmp(HYP_RESOURCE_GPIO_GPIO14_INITIAL_STATE, "high") == 0 || strcmp(HYP_RESOURCE_GPIO_GPIO14_INITIAL_STATE, "1") == 0) ? HIGH : LOW);
        #endif
    }
#endif

