Sohan-Chitluri/HyprAccel/sdk/src/hyp_esp32_hw.cpp
#ifdef HYP_RESOURCE_GPIO_GPIO15
    {
        int pin = 15; int mode = INPUT; bool is_output = false;
        #ifdef HYP_RESOURCE_GPIO_GPIO15_DIRECTION
            if (strcmp(HYP_RESOURCE_GPIO_GPIO15_DIRECTION, "output") == 0) { mode = OUTPUT; is_output = true; }
        #endif
        #ifdef HYP_RESOURCE_GPIO_GPIO15_PULL
            if (!is_output) {
                if (strcmp(HYP_RESOURCE_GPIO_GPIO15_PULL, "up") == 0 || strcmp(HYP_RESOURCE_GPIO_GPIO15_PULL, "pull-up") == 0) mode = INPUT_PULLUP;
                else if (strcmp(HYP_RESOURCE_GPIO_GPIO15_PULL, "down") == 0 || strcmp(HYP_RESOURCE_GPIO_GPIO15_PULL, "pull-down") == 0) mode = INPUT_PULLDOWN;
            }
        #endif
        pinMode(pin, mode);
        #ifdef HYP_RESOURCE_GPIO_GPIO15_INITIAL_STATE
            if (is_output) digitalWrite(pin, (strcmp(HYP_RESOURCE_GPIO_GPIO15_INITIAL_STATE, "high") == 0 || strcmp(HYP_RESOURCE_GPIO_GPIO15_INITIAL_STATE, "1") == 0) ? HIGH : LOW);
        #endif
    }
#endif

#ifdef HYP_RESOURCE_GPIO_GPIO16
    {
        int pin = 16; int mode = INPUT; bool is_output = false;
        #ifdef HYP_RESOURCE_GPIO_GPIO16_DIRECTION
            if (strcmp(HYP_RESOURCE_GPIO_GPIO16_DIRECTION, "output") == 0) { mode = OUTPUT; is_output = true; }
        #endif
        #ifdef HYP_RESOURCE_GPIO_GPIO16_PULL
            if (!is_output) {
                if (strcmp(HYP_RESOURCE_GPIO_GPIO16_PULL, "up") == 0 || strcmp(HYP_RESOURCE_GPIO_GPIO16_PULL, "pull-up") == 0) mode = INPUT_PULLUP;
                else if (strcmp(HYP_RESOURCE_GPIO_GPIO16_PULL, "down") == 0 || strcmp(HYP_RESOURCE_GPIO_GPIO16_PULL, "pull-down") == 0) mode = INPUT_PULLDOWN;
            }
        #endif
        pinMode(pin, mode);
        #ifdef HYP_RESOURCE_GPIO_GPIO16_INITIAL_STATE
            if (is_output) digitalWrite(pin, (strcmp(HYP_RESOURCE_GPIO_GPIO16_INITIAL_STATE, "high") == 0 || strcmp(HYP_RESOURCE_GPIO_GPIO16_INITIAL_STATE, "1") == 0) ? HIGH : LOW);
        #endif
    }
#endif

#ifdef HYP_RESOURCE_GPIO_GPIO17
    {
        int pin = 17; int mode = INPUT; bool is_output = false;
        #ifdef HYP_RESOURCE_GPIO_GPIO17_DIRECTION
            if (strcmp(HYP_RESOURCE_GPIO_GPIO17_DIRECTION, "output") == 0) { mode = OUTPUT; is_output = true; }
        #endif
        #ifdef HYP_RESOURCE_GPIO_GPIO17_PULL
            if (!is_output) {
                if (strcmp(HYP_RESOURCE_GPIO_GPIO17_PULL, "up") == 0 || strcmp(HYP_RESOURCE_GPIO_GPIO17_PULL, "pull-up") == 0) mode = INPUT_PULLUP;
                else if (strcmp(HYP_RESOURCE_GPIO_GPIO17_PULL, "down") == 0 || strcmp(HYP_RESOURCE_GPIO_GPIO17_PULL, "pull-down") == 0) mode = INPUT_PULLDOWN;
            }
        #endif
        pinMode(pin, mode);
        #ifdef HYP_RESOURCE_GPIO_GPIO17_INITIAL_STATE
            if (is_output) digitalWrite(pin, (strcmp(HYP_RESOURCE_GPIO_GPIO17_INITIAL_STATE, "high") == 0 || strcmp(HYP_RESOURCE_GPIO_GPIO17_INITIAL_STATE, "1") == 0) ? HIGH : LOW);
        #endif
    }
#endif

#ifdef HYP_RESOURCE_GPIO_GPIO18
    {
        int pin = 18; int mode = INPUT; bool is_output = false;
        #ifdef HYP_RESOURCE_GPIO_GPIO18_DIRECTION
            if (strcmp(HYP_RESOURCE_GPIO_GPIO18_DIRECTION, "output") == 0) { mode = OUTPUT; is_output = true; }
        #endif
        #ifdef HYP_RESOURCE_GPIO_GPIO18_PULL
            if (!is_output) {
                if (strcmp(HYP_RESOURCE_GPIO_GPIO18_PULL, "up") == 0 || strcmp(HYP_RESOURCE_GPIO_GPIO18_PULL, "pull-up") == 0) mode = INPUT_PULLUP;
                else if (strcmp(HYP_RESOURCE_GPIO_GPIO18_PULL, "down") == 0 || strcmp(HYP_RESOURCE_GPIO_GPIO18_PULL, "pull-down") == 0) mode = INPUT_PULLDOWN;
            }
        #endif
        pinMode(pin, mode);
        #ifdef HYP_RESOURCE_GPIO_GPIO18_INITIAL_STATE
            if (is_output) digitalWrite(pin, (strcmp(HYP_RESOURCE_GPIO_GPIO18_INITIAL_STATE, "high") == 0 || strcmp(HYP_RESOURCE_GPIO_GPIO18_INITIAL_STATE, "1") == 0) ? HIGH : LOW);
        #endif
    }
#endif

#ifdef HYP_RESOURCE_GPIO_GPIO19
    {
        int pin = 19; int mode = INPUT; bool is_output = false;
        #ifdef HYP_RESOURCE_GPIO_GPIO19_DIRECTION
            if (strcmp(HYP_RESOURCE_GPIO_GPIO19_DIRECTION, "output") == 0) { mode = OUTPUT; is_output = true; }
        #endif
        #ifdef HYP_RESOURCE_GPIO_GPIO19_PULL
            if (!is_output) {
                if (strcmp(HYP_RESOURCE_GPIO_GPIO19_PULL, "up") == 0 || strcmp(HYP_RESOURCE_GPIO_GPIO19_PULL, "pull-up") == 0) mode = INPUT_PULLUP;
                else if (strcmp(HYP_RESOURCE_GPIO_GPIO19_PULL, "down") == 0 || strcmp(HYP_RESOURCE_GPIO_GPIO19_PULL, "pull-down") == 0) mode = INPUT_PULLDOWN;
            }
        #endif
        pinMode(pin, mode);
        #ifdef HYP_RESOURCE_GPIO_GPIO19_INITIAL_STATE
            if (is_output) digitalWrite(pin, (strcmp(HYP_RESOURCE_GPIO_GPIO19_INITIAL_STATE, "high") == 0 || strcmp(HYP_RESOURCE_GPIO_GPIO19_INITIAL_STATE, "1") == 0) ? HIGH : LOW);
        #endif
    }
#endif

#ifdef HYP_RESOURCE_GPIO_GPIO21
    {
        int pin = 21; int mode = INPUT; bool is_output = false;
        #ifdef HYP_RESOURCE_GPIO_GPIO21_DIRECTION
            if (strcmp(HYP_RESOURCE_GPIO_GPIO21_DIRECTION, "output") == 0) { mode = OUTPUT; is_output = true; }
        #endif
        #ifdef HYP_RESOURCE_GPIO_GPIO21_PULL
            if (!is_output) {
                if (strcmp(HYP_RESOURCE_GPIO_GPIO21_PULL, "up") == 0 || strcmp(HYP_RESOURCE_GPIO_GPIO21_PULL, "pull-up") == 0) mode = INPUT_PULLUP;
                else if (strcmp(HYP_RESOURCE_GPIO_GPIO21_PULL, "down") == 0 || strcmp(HYP_RESOURCE_GPIO_GPIO21_PULL, "pull-down") == 0) mode = INPUT_PULLDOWN;
            }
        #endif
        pinMode(pin, mode);
        #ifdef HYP_RESOURCE_GPIO_GPIO21_INITIAL_STATE
            if (is_output) digitalWrite(pin, (strcmp(HYP_RESOURCE_GPIO_GPIO21_INITIAL_STATE, "high") == 0 || strcmp(HYP_RESOURCE_GPIO_GPIO21_INITIAL_STATE, "1") == 0) ? HIGH : LOW);
        #endif
    }
#endif

#ifdef HYP_RESOURCE_GPIO_GPIO22
    {
        int pin = 22; int mode = INPUT; bool is_output = false;
        #ifdef HYP_RESOURCE_GPIO_GPIO22_DIRECTION
            if (strcmp(HYP_RESOURCE_GPIO_GPIO22_DIRECTION, "output") == 0) { mode = OUTPUT; is_output = true; }
        #endif
        #ifdef HYP_RESOURCE_GPIO_GPIO22_PULL
            if (!is_output) {
                if (strcmp(HYP_RESOURCE_GPIO_GPIO22_PULL, "up") == 0 || strcmp(HYP_RESOURCE_GPIO_GPIO22_PULL, "pull-up") == 0) mode = INPUT_PULLUP;
                else if (strcmp(HYP_RESOURCE_GPIO_GPIO22_PULL, "down") == 0 || strcmp(HYP_RESOURCE_GPIO_GPIO22_PULL, "pull-down") == 0) mode = INPUT_PULLDOWN;
            }
        #endif
        pinMode(pin, mode);
        #ifdef HYP_RESOURCE_GPIO_GPIO22_INITIAL_STATE
            if (is_output) digitalWrite(pin, (strcmp(HYP_RESOURCE_GPIO_GPIO22_INITIAL_STATE, "high") == 0 || strcmp(HYP_RESOURCE_GPIO_GPIO22_INITIAL_STATE, "1") == 0) ? HIGH : LOW);
        #endif
    }
#endif

#ifdef HYP_RESOURCE_GPIO_GPIO23
    {
        int pin = 23; int mode = INPUT; bool is_output = false;
        #ifdef HYP_RESOURCE_GPIO_GPIO23_DIRECTION
            if (strcmp(HYP_RESOURCE_GPIO_GPIO23_DIRECTION, "output") == 0) { mode = OUTPUT; is_output = true; }
        #endif
        #ifdef HYP_RESOURCE_GPIO_GPIO23_PULL
            if (!is_output) {
                if (strcmp(HYP_RESOURCE_GPIO_GPIO23_PULL, "up") == 0 || strcmp(HYP_RESOURCE_GPIO_GPIO23_PULL, "pull-up") == 0) mode = INPUT_PULLUP;
                else if (strcmp(HYP_RESOURCE_GPIO_GPIO23_PULL, "down") == 0 || strcmp(HYP_RESOURCE_GPIO_GPIO23_PULL, "pull-down") == 0) mode = INPUT_PULLDOWN;
            }
        #endif
        pinMode(pin, mode);
        #ifdef HYP_RESOURCE_GPIO_GPIO23_INITIAL_STATE
            if (is_output) digitalWrite(pin, (strcmp(HYP_RESOURCE_GPIO_GPIO23_INITIAL_STATE, "high") == 0 || strcmp(HYP_RESOURCE_GPIO_GPIO23_INITIAL_STATE, "1") == 0) ? HIGH : LOW);
        #endif
    }
#endif

#ifdef HYP_RESOURCE_GPIO_GPIO25
    {
        int pin = 25; int mode = INPUT; bool is_output = false;
        #ifdef HYP_RESOURCE_GPIO_GPIO25_DIRECTION
            if (strcmp(HYP_RESOURCE_GPIO_GPIO25_DIRECTION, "output") == 0) { mode = OUTPUT; is_output = true; }
        #endif
        #ifdef HYP_RESOURCE_GPIO_GPIO25_PULL
            if (!is_output) {
                if (strcmp(HYP_RESOURCE_GPIO_GPIO25_PULL, "up") == 0 || strcmp(HYP_RESOURCE_GPIO_GPIO25_PULL, "pull-up") == 0) mode = INPUT_PULLUP;
                else if (strcmp(HYP_RESOURCE_GPIO_GPIO25_PULL, "down") == 0 || strcmp(HYP_RESOURCE_GPIO_GPIO25_PULL, "pull-down") == 0) mode = INPUT_PULLDOWN;
            }
        #endif
        pinMode(pin, mode);
        #ifdef HYP_RESOURCE_GPIO_GPIO25_INITIAL_STATE
            if (is_output) digitalWrite(pin, (strcmp(HYP_RESOURCE_GPIO_GPIO25_INITIAL_STATE, "high") == 0 || strcmp(HYP_RESOURCE_GPIO_GPIO25_INITIAL_STATE, "1") == 0) ? HIGH : LOW);
        #endif
    }
#endif

#ifdef HYP_RESOURCE_GPIO_GPIO26
    {
        int pin = 26; int mode = INPUT; bool is_output = false;
        #ifdef HYP_RESOURCE_GPIO_GPIO26_DIRECTION
            if (strcmp(HYP_RESOURCE_GPIO_GPIO26_DIRECTION, "output") == 0) { mode = OUTPUT; is_output = true; }
        #endif
        #ifdef HYP_RESOURCE_GPIO_GPIO26_PULL
            if (!is_output) {
                if (strcmp(HYP_RESOURCE_GPIO_GPIO26_PULL, "up") == 0 || strcmp(HYP_RESOURCE_GPIO_GPIO26_PULL, "pull-up") == 0) mode = INPUT_PULLUP;
                else if (strcmp(HYP_RESOURCE_GPIO_GPIO26_PULL, "down") == 0 || strcmp(HYP_RESOURCE_GPIO_GPIO26_PULL, "pull-down") == 0) mode = INPUT_PULLDOWN;
            }
        #endif
        pinMode(pin, mode);
        #ifdef HYP_RESOURCE_GPIO_GPIO26_INITIAL_STATE
            if (is_output) digitalWrite(pin, (strcmp(HYP_RESOURCE_GPIO_GPIO26_INITIAL_STATE, "high") == 0 || strcmp(HYP_RESOURCE_GPIO_GPIO26_INITIAL_STATE, "1") == 0) ? HIGH : LOW);
        #endif
    }
#endif

#ifdef HYP_RESOURCE_GPIO_GPIO27
    {
        int pin = 27; int mode = INPUT; bool is_output = false;
        #ifdef HYP_RESOURCE_GPIO_GPIO27_DIRECTION
            if (strcmp(HYP_RESOURCE_GPIO_GPIO27_DIRECTION, "output") == 0) { mode = OUTPUT; is_output = true; }
        #endif
        #ifdef HYP_RESOURCE_GPIO_GPIO27_PULL
            if (!is_output) {
                if (strcmp(HYP_RESOURCE_GPIO_GPIO27_PULL, "up") == 0 || strcmp(HYP_RESOURCE_GPIO_GPIO27_PULL, "pull-up") == 0) mode = INPUT_PULLUP;
                else if (strcmp(HYP_RESOURCE_GPIO_GPIO27_PULL, "down") == 0 || strcmp(HYP_RESOURCE_GPIO_GPIO27_PULL, "pull-down") == 0) mode = INPUT_PULLDOWN;
            }
        #endif
        pinMode(pin, mode);
        #ifdef HYP_RESOURCE_GPIO_GPIO27_INITIAL_STATE
            if (is_output) digitalWrite(pin, (strcmp(HYP_RESOURCE_GPIO_GPIO27_INITIAL_STATE, "high") == 0 || strcmp(HYP_RESOURCE_GPIO_GPIO27_INITIAL_STATE, "1") == 0) ? HIGH : LOW);
        #endif
    }
#endif

#ifdef HYP_RESOURCE_GPIO_GPIO32
    {
        int pin = 32; int mode = INPUT; bool is_output = false;
        #ifdef HYP_RESOURCE_GPIO_GPIO32_DIRECTION
            if (strcmp(HYP_RESOURCE_GPIO_GPIO32_DIRECTION, "output") == 0) { mode = OUTPUT; is_output = true; }
        #endif
        #ifdef HYP_RESOURCE_GPIO_GPIO32_PULL
            if (!is_output) {
                if (strcmp(HYP_RESOURCE_GPIO_GPIO32_PULL, "up") == 0 || strcmp(HYP_RESOURCE_GPIO_GPIO32_PULL, "pull-up") == 0) mode = INPUT_PULLUP;
                else if (strcmp(HYP_RESOURCE_GPIO_GPIO32_PULL, "down") == 0 || strcmp(HYP_RESOURCE_GPIO_GPIO32_PULL, "pull-down") == 0) mode = INPUT_PULLDOWN;
            }
        #endif
        pinMode(pin, mode);
        #ifdef HYP_RESOURCE_GPIO_GPIO32_INITIAL_STATE
            if (is_output) digitalWrite(pin, (strcmp(HYP_RESOURCE_GPIO_GPIO32_INITIAL_STATE, "high") == 0 || strcmp(HYP_RESOURCE_GPIO_GPIO32_INITIAL_STATE, "1") == 0) ? HIGH : LOW);
        #endif
    }
#endif

#ifdef HYP_RESOURCE_GPIO_GPIO33
    {
        int pin = 33; int mode = INPUT; bool is_output = false;
        #ifdef HYP_RESOURCE_GPIO_GPIO33_DIRECTION
            if (strcmp(HYP_RESOURCE_GPIO_GPIO33_DIRECTION, "output") == 0) { mode = OUTPUT; is_output = true; }
        #endif
        #ifdef HYP_RESOURCE_GPIO_GPIO33_PULL
            if (!is_output) {
                if (strcmp(HYP_RESOURCE_GPIO_GPIO33_PULL, "up") == 0 || strcmp(HYP_RESOURCE_GPIO_GPIO33_PULL, "pull-up") == 0) mode = INPUT_PULLUP;
                else if (strcmp(HYP_RESOURCE_GPIO_GPIO33_PULL, "down") == 0 || strcmp(HYP_RESOURCE_GPIO_GPIO33_PULL, "pull-down") == 0) mode = INPUT_PULLDOWN;
            }
        #endif
        pinMode(pin, mode);
        #ifdef HYP_RESOURCE_GPIO_GPIO33_INITIAL_STATE
            if (is_output) digitalWrite(pin, (strcmp(HYP_RESOURCE_GPIO_GPIO33_INITIAL_STATE, "high") == 0 || strcmp(HYP_RESOURCE_GPIO_GPIO33_INITIAL_STATE, "1") == 0) ? HIGH : LOW);
        #endif
    }
#endif

