Sohan-Chitluri/HyprAccel/sdk/src/hyp_esp32_hw.cpp
#ifdef HYP_RESOURCE_GPIO_GPIO34
    {
        int pin = 34; int mode = INPUT; bool is_output = false;
        #ifdef HYP_RESOURCE_GPIO_GPIO34_DIRECTION
            if (strcmp(HYP_RESOURCE_GPIO_GPIO34_DIRECTION, "output") == 0) { mode = OUTPUT; is_output = true; }
        #endif
        #ifdef HYP_RESOURCE_GPIO_GPIO34_PULL
            if (!is_output) {
                if (strcmp(HYP_RESOURCE_GPIO_GPIO34_PULL, "up") == 0 || strcmp(HYP_RESOURCE_GPIO_GPIO34_PULL, "pull-up") == 0) mode = INPUT_PULLUP;
                else if (strcmp(HYP_RESOURCE_GPIO_GPIO34_PULL, "down") == 0 || strcmp(HYP_RESOURCE_GPIO_GPIO34_PULL, "pull-down") == 0) mode = INPUT_PULLDOWN;
            }
        #endif
        pinMode(pin, mode);
        #ifdef HYP_RESOURCE_GPIO_GPIO34_INITIAL_STATE
            if (is_output) digitalWrite(pin, (strcmp(HYP_RESOURCE_GPIO_GPIO34_INITIAL_STATE, "high") == 0 || strcmp(HYP_RESOURCE_GPIO_GPIO34_INITIAL_STATE, "1") == 0) ? HIGH : LOW);
        #endif
    }
#endif

#ifdef HYP_RESOURCE_GPIO_GPIO35
    {
        int pin = 35; int mode = INPUT; bool is_output = false;
        #ifdef HYP_RESOURCE_GPIO_GPIO35_DIRECTION
            if (strcmp(HYP_RESOURCE_GPIO_GPIO35_DIRECTION, "output") == 0) { mode = OUTPUT; is_output = true; }
        #endif
        #ifdef HYP_RESOURCE_GPIO_GPIO35_PULL
            if (!is_output) {
                if (strcmp(HYP_RESOURCE_GPIO_GPIO35_PULL, "up") == 0 || strcmp(HYP_RESOURCE_GPIO_GPIO35_PULL, "pull-up") == 0) mode = INPUT_PULLUP;
                else if (strcmp(HYP_RESOURCE_GPIO_GPIO35_PULL, "down") == 0 || strcmp(HYP_RESOURCE_GPIO_GPIO35_PULL, "pull-down") == 0) mode = INPUT_PULLDOWN;
            }
        #endif
        pinMode(pin, mode);
        #ifdef HYP_RESOURCE_GPIO_GPIO35_INITIAL_STATE
            if (is_output) digitalWrite(pin, (strcmp(HYP_RESOURCE_GPIO_GPIO35_INITIAL_STATE, "high") == 0 || strcmp(HYP_RESOURCE_GPIO_GPIO35_INITIAL_STATE, "1") == 0) ? HIGH : LOW);
        #endif
    }
#endif

#ifdef HYP_RESOURCE_GPIO_GPIO36
    {
        int pin = 36; int mode = INPUT; bool is_output = false;
        #ifdef HYP_RESOURCE_GPIO_GPIO36_DIRECTION
            if (strcmp(HYP_RESOURCE_GPIO_GPIO36_DIRECTION, "output") == 0) { mode = OUTPUT; is_output = true; }
        #endif
        #ifdef HYP_RESOURCE_GPIO_GPIO36_PULL
            if (!is_output) {
                if (strcmp(HYP_RESOURCE_GPIO_GPIO36_PULL, "up") == 0 || strcmp(HYP_RESOURCE_GPIO_GPIO36_PULL, "pull-up") == 0) mode = INPUT_PULLUP;
                else if (strcmp(HYP_RESOURCE_GPIO_GPIO36_PULL, "down") == 0 || strcmp(HYP_RESOURCE_GPIO_GPIO36_PULL, "pull-down") == 0) mode = INPUT_PULLDOWN;
            }
        #endif
        pinMode(pin, mode);
        #ifdef HYP_RESOURCE_GPIO_GPIO36_INITIAL_STATE
            if (is_output) digitalWrite(pin, (strcmp(HYP_RESOURCE_GPIO_GPIO36_INITIAL_STATE, "high") == 0 || strcmp(HYP_RESOURCE_GPIO_GPIO36_INITIAL_STATE, "1") == 0) ? HIGH : LOW);
        #endif
    }
#endif

#ifdef HYP_RESOURCE_GPIO_GPIO39
    {
        int pin = 39; int mode = INPUT; bool is_output = false;
        #ifdef HYP_RESOURCE_GPIO_GPIO39_DIRECTION
            if (strcmp(HYP_RESOURCE_GPIO_GPIO39_DIRECTION, "output") == 0) { mode = OUTPUT; is_output = true; }
        #endif
        #ifdef HYP_RESOURCE_GPIO_GPIO39_PULL
            if (!is_output) {
                if (strcmp(HYP_RESOURCE_GPIO_GPIO39_PULL, "up") == 0 || strcmp(HYP_RESOURCE_GPIO_GPIO39_PULL, "pull-up") == 0) mode = INPUT_PULLUP;
                else if (strcmp(HYP_RESOURCE_GPIO_GPIO39_PULL, "down") == 0 || strcmp(HYP_RESOURCE_GPIO_GPIO39_PULL, "pull-down") == 0) mode = INPUT_PULLDOWN;
            }
        #endif
        pinMode(pin, mode);
        #ifdef HYP_RESOURCE_GPIO_GPIO39_INITIAL_STATE
            if (is_output) digitalWrite(pin, (strcmp(HYP_RESOURCE_GPIO_GPIO39_INITIAL_STATE, "high") == 0 || strcmp(HYP_RESOURCE_GPIO_GPIO39_INITIAL_STATE, "1") == 0) ? HIGH : LOW);
        #endif
    }
#endif

    // -------------------------------------------------------------------------
    // 2. UART Configuration
    // -------------------------------------------------------------------------
#ifdef HYP_RESOURCE_UART_UART0
    {
        /* UART0 / Serial is already initialised by setup() before hyp_esp32_hw_init()
         * is called.  Calling Serial.begin() a second time reinitialises the UART
         * hardware peripheral and can flush / corrupt bytes that are still queued
         * in the TX FIFO (observed as truncated HYPRACCEL_MBD_T9_READY output).
         * Skip the redundant begin(); the port is already open at 115200 baud. */
        Serial.println("[INFO] UART0 already initialised by setup().");
    }
#endif

#if defined(HYP_RESOURCE_UART_UART1) && defined(HYP_RESOURCE_UART_UART1_TX_PIN) && defined(HYP_RESOURCE_UART_UART1_RX_PIN)
    /* ESP32-WROOM-32: GPIO9 and GPIO10 are routed to the internal SPI flash in
     * QIO mode.  Attempting Serial1.begin() on those pins corrupts flash access
     * and causes a hard fault.  Skip UART1 init when the board config assigns
     * either of those pins to the UART1 bus. */
#  if (HYP_RESOURCE_UART_UART1_TX_PIN == 9  || HYP_RESOURCE_UART_UART1_TX_PIN == 10 || \
       HYP_RESOURCE_UART_UART1_RX_PIN == 9  || HYP_RESOURCE_UART_UART1_RX_PIN == 10)
    Serial.println("[WARN] UART1 skipped: TX/RX pin conflicts with internal SPI flash (GPIO9/GPIO10).");
#  else
    {
        long baud = 115200;
        #ifdef HYP_RESOURCE_UART_UART1_BAUD_RATE
            baud = HYP_RESOURCE_UART_UART1_BAUD_RATE;
        #endif
        Serial1.begin(baud, SERIAL_8N1, HYP_RESOURCE_UART_UART1_RX_PIN, HYP_RESOURCE_UART_UART1_TX_PIN);
        Serial.println("[INFO] UART1 initialized.");
    }
#  endif
#endif

#ifdef HYP_RESOURCE_UART_UART2
    {
        long baud = 115200;
        #ifdef HYP_RESOURCE_UART_UART2_BAUD_RATE
            baud = HYP_RESOURCE_UART_UART2_BAUD_RATE;
        #endif
        #if defined(HYP_RESOURCE_UART_UART2_TX_PIN) && defined(HYP_RESOURCE_UART_UART2_RX_PIN)
            Serial2.begin(baud, SERIAL_8N1, HYP_RESOURCE_UART_UART2_RX_PIN, HYP_RESOURCE_UART_UART2_TX_PIN);
        #else
            #error "UART2 enabled but HYP_RESOURCE_UART_UART2_TX_PIN / _RX_PIN not defined in hyp_board_config.h"
        #endif
        Serial.println("[INFO] UART2 initialized.");
    }
#endif

    // -------------------------------------------------------------------------
    // 3. SPI Configuration
    // -------------------------------------------------------------------------
#ifdef HYP_RESOURCE_SPI_HSPI
    {
        #if !defined(HYP_RESOURCE_SPI_HSPI_SCK_PIN) || !defined(HYP_RESOURCE_SPI_HSPI_MOSI_PIN) \
         || !defined(HYP_RESOURCE_SPI_HSPI_MISO_PIN) || !defined(HYP_RESOURCE_SPI_HSPI_CS_PIN)
            #error "SPI HSPI enabled but pin macros missing from hyp_board_config.h"
        #endif
        long freq = 1000000;
        #ifdef HYP_RESOURCE_SPI_HSPI_FREQUENCY_HZ
            freq = HYP_RESOURCE_SPI_HSPI_FREQUENCY_HZ;
        #endif
        int mode = SPI_MODE0;
        #ifdef HYP_RESOURCE_SPI_HSPI_MODE
            int raw_mode = HYP_RESOURCE_SPI_HSPI_MODE;
            if (raw_mode == 1) mode = SPI_MODE1;
            else if (raw_mode == 2) mode = SPI_MODE2;
            else if (raw_mode == 3) mode = SPI_MODE3;
        #endif
        g_hspi_bus = new SPIClass(HSPI);
        g_hspi_bus->begin(HYP_RESOURCE_SPI_HSPI_SCK_PIN,
                          HYP_RESOURCE_SPI_HSPI_MISO_PIN,
                          HYP_RESOURCE_SPI_HSPI_MOSI_PIN,
                          HYP_RESOURCE_SPI_HSPI_CS_PIN);
        g_hspi_freq = (uint32_t)freq;
        g_hspi_mode = (uint8_t)mode;
        pinMode(HYP_RESOURCE_SPI_HSPI_CS_PIN, OUTPUT);
        digitalWrite(HYP_RESOURCE_SPI_HSPI_CS_PIN, HIGH);
        Serial.println("[INFO] SPI HSPI initialized.");
    }
#endif

#ifdef HYP_RESOURCE_SPI_VSPI
    {
        #if !defined(HYP_RESOURCE_SPI_VSPI_SCK_PIN) || !defined(HYP_RESOURCE_SPI_VSPI_MOSI_PIN) \
         || !defined(HYP_RESOURCE_SPI_VSPI_MISO_PIN) || !defined(HYP_RESOURCE_SPI_VSPI_CS_PIN)
            #error "SPI VSPI enabled but pin macros missing from hyp_board_config.h"
        #endif
        long freq = 1000000;
        #ifdef HYP_RESOURCE_SPI_VSPI_FREQUENCY_HZ
            freq = HYP_RESOURCE_SPI_VSPI_FREQUENCY_HZ;
        #endif
        int mode = SPI_MODE0;
        #ifdef HYP_RESOURCE_SPI_VSPI_MODE
            int raw_mode = HYP_RESOURCE_SPI_VSPI_MODE;
            if (raw_mode == 1) mode = SPI_MODE1;
            else if (raw_mode == 2) mode = SPI_MODE2;
            else if (raw_mode == 3) mode = SPI_MODE3;
        #endif
        g_vspi_bus = new SPIClass(VSPI);
        g_vspi_bus->begin(HYP_RESOURCE_SPI_VSPI_SCK_PIN,
                          HYP_RESOURCE_SPI_VSPI_MISO_PIN,
                          HYP_RESOURCE_SPI_VSPI_MOSI_PIN,
                          HYP_RESOURCE_SPI_VSPI_CS_PIN);
        g_vspi_freq = (uint32_t)freq;
        g_vspi_mode = (uint8_t)mode;
        pinMode(HYP_RESOURCE_SPI_VSPI_CS_PIN, OUTPUT);
        digitalWrite(HYP_RESOURCE_SPI_VSPI_CS_PIN, HIGH);
        Serial.println("[INFO] SPI VSPI initialized.");
    }
#endif

    // -------------------------------------------------------------------------
    // 4. I2C Configuration
    // -------------------------------------------------------------------------
#ifdef HYP_RESOURCE_I2C_I2C0
    {
        #if !defined(HYP_RESOURCE_I2C_I2C0_SDA_PIN) || !defined(HYP_RESOURCE_I2C_I2C0_SCL_PIN)
            #error "I2C I2C0 enabled but HYP_RESOURCE_I2C_I2C0_SDA_PIN / _SCL_PIN not defined"
        #endif
        long freq = 400000;
        #ifdef HYP_RESOURCE_I2C_I2C0_FREQUENCY_HZ
            freq = HYP_RESOURCE_I2C_I2C0_FREQUENCY_HZ;
        #endif
        Wire.begin(HYP_RESOURCE_I2C_I2C0_SDA_PIN, HYP_RESOURCE_I2C_I2C0_SCL_PIN, (uint32_t)freq);
        Serial.println("[INFO] I2C I2C0 initialized.");
    }
#endif

    // -------------------------------------------------------------------------
    // 5. PWM Configuration
    // -------------------------------------------------------------------------
#ifdef HYP_RESOURCE_PWM_GPIO25
    {
        int pin = 25; long freq = 50; int res_bits = 16; int initial_duty = 0;
        #ifdef HYP_RESOURCE_PWM_GPIO25_FREQUENCY_HZ
            freq = HYP_RESOURCE_PWM_GPIO25_FREQUENCY_HZ;
        #endif
        #ifdef HYP_RESOURCE_PWM_GPIO25_RESOLUTION_BITS
            res_bits = HYP_RESOURCE_PWM_GPIO25_RESOLUTION_BITS;
        #endif
        #ifdef HYP_RESOURCE_PWM_GPIO25_INITIAL_DUTY
            initial_duty = HYP_RESOURCE_PWM_GPIO25_INITIAL_DUTY;
        #endif
        #if defined(ESP_ARDUINO_VERSION_MAJOR) && ESP_ARDUINO_VERSION_MAJOR >= 3
            ledcAttach(pin, freq, res_bits); ledcWrite(pin, initial_duty);
        #else
            int chan = next_pwm_channel++;
            if (chan < 16) { ledcSetup(chan, freq, res_bits); ledcAttachPin(pin, chan); ledcWrite(chan, initial_duty); }
        #endif
        Serial.println("[INFO] PWM GPIO25 initialized.");
    }
#endif

#ifdef HYP_RESOURCE_PWM_GPIO26
    {
        int pin = 26; long freq = 50; int res_bits = 16; int initial_duty = 0;
        #ifdef HYP_RESOURCE_PWM_GPIO26_FREQUENCY_HZ
            freq = HYP_RESOURCE_PWM_GPIO26_FREQUENCY_HZ;
        #endif
        #ifdef HYP_RESOURCE_PWM_GPIO26_RESOLUTION_BITS
            res_bits = HYP_RESOURCE_PWM_GPIO26_RESOLUTION_BITS;
        #endif
        #ifdef HYP_RESOURCE_PWM_GPIO26_INITIAL_DUTY
            initial_duty = HYP_RESOURCE_PWM_GPIO26_INITIAL_DUTY;
        #endif
        #if defined(ESP_ARDUINO_VERSION_MAJOR) && ESP_ARDUINO_VERSION_MAJOR >= 3
            ledcAttach(pin, freq, res_bits); ledcWrite(pin, initial_duty);
        #else
            int chan = next_pwm_channel++;
            if (chan < 16) { ledcSetup(chan, freq, res_bits); ledcAttachPin(pin, chan); ledcWrite(chan, initial_duty); }
        #endif
        Serial.println("[INFO] PWM GPIO26 initialized.");
    }
#endif

#ifdef HYP_RESOURCE_PWM_GPIO27
    {
        int pin = 27; long freq = 50; int res_bits = 16; int initial_duty = 0;
        #ifdef HYP_RESOURCE_PWM_GPIO27_FREQUENCY_HZ
            freq = HYP_RESOURCE_PWM_GPIO27_FREQUENCY_HZ;
        #endif
        #ifdef HYP_RESOURCE_PWM_GPIO27_RESOLUTION_BITS
            res_bits = HYP_RESOURCE_PWM_GPIO27_RESOLUTION_BITS;
        #endif
        #ifdef HYP_RESOURCE_PWM_GPIO27_INITIAL_DUTY
            initial_duty = HYP_RESOURCE_PWM_GPIO27_INITIAL_DUTY;
        #endif
        #if defined(ESP_ARDUINO_VERSION_MAJOR) && ESP_ARDUINO_VERSION_MAJOR >= 3
            ledcAttach(pin, freq, res_bits); ledcWrite(pin, initial_duty);
        #else
            int chan = next_pwm_channel++;
            if (chan < 16) { ledcSetup(chan, freq, res_bits); ledcAttachPin(pin, chan); ledcWrite(chan, initial_duty); }
        #endif
        Serial.println("[INFO] PWM GPIO27 initialized.");
    }
#endif

#ifdef HYP_RESOURCE_PWM_GPIO32
    {
        int pin = 32; long freq = 50; int res_bits = 16; int initial_duty = 0;
        #ifdef HYP_RESOURCE_PWM_GPIO32_FREQUENCY_HZ
            freq = HYP_RESOURCE_PWM_GPIO32_FREQUENCY_HZ;
        #endif
        #ifdef HYP_RESOURCE_PWM_GPIO32_RESOLUTION_BITS
            res_bits = HYP_RESOURCE_PWM_GPIO32_RESOLUTION_BITS;
        #endif
        #ifdef HYP_RESOURCE_PWM_GPIO32_INITIAL_DUTY
            initial_duty = HYP_RESOURCE_PWM_GPIO32_INITIAL_DUTY;
        #endif
        #if defined(ESP_ARDUINO_VERSION_MAJOR) && ESP_ARDUINO_VERSION_MAJOR >= 3
            ledcAttach(pin, freq, res_bits); ledcWrite(pin, initial_duty);
        #else
            int chan = next_pwm_channel++;
            if (chan < 16) { ledcSetup(chan, freq, res_bits); ledcAttachPin(pin, chan); ledcWrite(chan, initial_duty); }
        #endif
        Serial.println("[INFO] PWM GPIO32 initialized.");
    }
#endif

#ifdef HYP_RESOURCE_PWM_GPIO33
    {
        int pin = 33; long freq = 50; int res_bits = 16; int initial_duty = 0;
        #ifdef HYP_RESOURCE_PWM_GPIO33_FREQUENCY_HZ
            freq = HYP_RESOURCE_PWM_GPIO33_FREQUENCY_HZ;
        #endif
        #ifdef HYP_RESOURCE_PWM_GPIO33_RESOLUTION_BITS
            res_bits = HYP_RESOURCE_PWM_GPIO33_RESOLUTION_BITS;
        #endif
        #ifdef HYP_RESOURCE_PWM_GPIO33_INITIAL_DUTY
            initial_duty = HYP_RESOURCE_PWM_GPIO33_INITIAL_DUTY;
        #endif
        #if defined(ESP_ARDUINO_VERSION_MAJOR) && ESP_ARDUINO_VERSION_MAJOR >= 3
            ledcAttach(pin, freq, res_bits); ledcWrite(pin, initial_duty);
        #else
            int chan = next_pwm_channel++;
            if (chan < 16) { ledcSetup(chan, freq, res_bits); ledcAttachPin(pin, chan); ledcWrite(chan, initial_duty); }
        #endif
        Serial.println("[INFO] PWM GPIO33 initialized.");
    }
#endif

    // -------------------------------------------------------------------------
    // 6. ADC Configuration
    // -------------------------------------------------------------------------
#ifdef HYP_RESOURCE_ADC_GPIO32
    {
        int pin = 32; pinMode(pin, ANALOG); adc_attenuation_t atten = ADC_11db;
        #ifdef HYP_RESOURCE_ADC_GPIO32_ATTENUATION_DB
            float atten_val = HYP_RESOURCE_ADC_GPIO32_ATTENUATION_DB;
            if (atten_val == 0.0f) atten = ADC_0db;
            else if (atten_val > 0.0f && atten_val <= 2.5f) atten = ADC_2_5db;
            else if (atten_val > 2.5f && atten_val <= 6.0f) atten = ADC_6db;
            else if (atten_val > 6.0f) atten = ADC_11db;
        #endif
        analogSetPinAttenuation(pin, atten);
        Serial.println("[INFO] ADC GPIO32 initialized.");
    }
#endif

#ifdef HYP_RESOURCE_ADC_GPIO33
    {
        int pin = 33; pinMode(pin, ANALOG); adc_attenuation_t atten = ADC_11db;
        #ifdef HYP_RESOURCE_ADC_GPIO33_ATTENUATION_DB
            float atten_val = HYP_RESOURCE_ADC_GPIO33_ATTENUATION_DB;
            if (atten_val == 0.0f) atten = ADC_0db;
            else if (atten_val > 0.0f && atten_val <= 2.5f) atten = ADC_2_5db;
            else if (atten_val > 2.5f && atten_val <= 6.0f) atten = ADC_6db;
            else if (atten_val > 6.0f) atten = ADC_11db;
        #endif
        analogSetPinAttenuation(pin, atten);
        Serial.println("[INFO] ADC GPIO33 initialized.");
    }
#endif

