Sohan-Chitluri/HyprAccel/sdk/src/hyp_esp32_hw.cpp
#ifdef HYP_RESOURCE_ADC_GPIO34
    {
        int pin = 34; pinMode(pin, ANALOG); adc_attenuation_t atten = ADC_11db;
        #ifdef HYP_RESOURCE_ADC_GPIO34_ATTENUATION_DB
            float atten_val = HYP_RESOURCE_ADC_GPIO34_ATTENUATION_DB;
            if (atten_val == 0.0f) atten = ADC_0db;
            else if (atten_val > 0.0f && atten_val <= 2.5f) atten = ADC_2_5db;
            else if (atten_val > 2.5f && atten_val <= 6.0f) atten = ADC_6db;
            else if (atten_val > 6.0f) atten = ADC_11db;
        #endif
        analogSetPinAttenuation(pin, atten);
        Serial.println("[INFO] ADC GPIO34 initialized.");
    }
#endif

#ifdef HYP_RESOURCE_ADC_GPIO35
    {
        int pin = 35; pinMode(pin, ANALOG); adc_attenuation_t atten = ADC_11db;
        #ifdef HYP_RESOURCE_ADC_GPIO35_ATTENUATION_DB
            float atten_val = HYP_RESOURCE_ADC_GPIO35_ATTENUATION_DB;
            if (atten_val == 0.0f) atten = ADC_0db;
            else if (atten_val > 0.0f && atten_val <= 2.5f) atten = ADC_2_5db;
            else if (atten_val > 2.5f && atten_val <= 6.0f) atten = ADC_6db;
            else if (atten_val > 6.0f) atten = ADC_11db;
        #endif
        analogSetPinAttenuation(pin, atten);
        Serial.println("[INFO] ADC GPIO35 initialized.");
    }
#endif

#ifdef HYP_RESOURCE_ADC_GPIO36
    {
        int pin = 36; pinMode(pin, ANALOG); adc_attenuation_t atten = ADC_11db;
        #ifdef HYP_RESOURCE_ADC_GPIO36_ATTENUATION_DB
            float atten_val = HYP_RESOURCE_ADC_GPIO36_ATTENUATION_DB;
            if (atten_val == 0.0f) atten = ADC_0db;
            else if (atten_val > 0.0f && atten_val <= 2.5f) atten = ADC_2_5db;
            else if (atten_val > 2.5f && atten_val <= 6.0f) atten = ADC_6db;
            else if (atten_val > 6.0f) atten = ADC_11db;
        #endif
        analogSetPinAttenuation(pin, atten);
        Serial.println("[INFO] ADC GPIO36 initialized.");
    }
#endif

#ifdef HYP_RESOURCE_ADC_GPIO39
    {
        int pin = 39; pinMode(pin, ANALOG); adc_attenuation_t atten = ADC_11db;
        #ifdef HYP_RESOURCE_ADC_GPIO39_ATTENUATION_DB
            float atten_val = HYP_RESOURCE_ADC_GPIO39_ATTENUATION_DB;
            if (atten_val == 0.0f) atten = ADC_0db;
            else if (atten_val > 0.0f && atten_val <= 2.5f) atten = ADC_2_5db;
            else if (atten_val > 2.5f && atten_val <= 6.0f) atten = ADC_6db;
            else if (atten_val > 6.0f) atten = ADC_11db;
        #endif
        analogSetPinAttenuation(pin, atten);
        Serial.println("[INFO] ADC GPIO39 initialized.");
    }
#endif

#if ESP_ARDUINO_VERSION_MAJOR < 3
    if (next_pwm_channel > 16) {
        Serial.println("[ERROR] Exceeded maximum number of PWM channels (16).");
        return -1;
    }
#endif

    Serial.println("[INFO] ESP32 Hardware Initialized successfully.");
    return 0;
}

/* ==========================================================================
 * Sensor / Actuator Runtime Operations
 * ========================================================================== */

/**
 * Parse hardware resource ID (e.g., "adc.channel0", "pwm.motor0")
 * Returns the resource type (adc, gpio, pwm, etc.) and instance identifier.
 */
int parse_resource_id(const char *resource_id, char *type_out, size_t type_size, char *instance_out, size_t instance_size) {
    if (!resource_id || !type_out || !instance_out) return -1;
    
    const char *dot = strchr(resource_id, '.');
    if (!dot || dot == resource_id || dot[1] == '\0' || strchr(dot + 1, '.') != NULL) return -1;
    
    size_t type_len = dot - resource_id;
    if (type_len >= type_size) return -1;
    strncpy(type_out, resource_id, type_len);
    type_out[type_len] = '\0';
    
    const char *instance = dot + 1;
    size_t instance_len = strlen(instance);
    if (instance_len >= instance_size) return -1;
    strcpy(instance_out, instance);
    
    return 0;
}

/**
 * hyp_resource_pin_entry — compile-time table entry mapping a resource ID
 * string to its physical GPIO pin number.
 *
 * FW-P1..P6: All entries are derived from HYP_RESOURCE_*_PIN macros that
 * gen_board_config.js emits from boards.yaml.  No pin numbers are hardcoded
 * here; the table is built entirely from the generated configuration.
 */
typedef struct { const char *resource_id; int pin; } hyp_resource_pin_entry_t;

static const hyp_resource_pin_entry_t hyp_resource_pin_table[] = {
    /* ADC resources (FW-P6) */
#ifdef HYP_RESOURCE_ADC_GPIO32_PIN
    { "adc.GPIO32", HYP_RESOURCE_ADC_GPIO32_PIN },
#endif
#ifdef HYP_RESOURCE_ADC_GPIO33_PIN
    { "adc.GPIO33", HYP_RESOURCE_ADC_GPIO33_PIN },
#endif
#ifdef HYP_RESOURCE_ADC_GPIO34_PIN
    { "adc.GPIO34", HYP_RESOURCE_ADC_GPIO34_PIN },
#endif
#ifdef HYP_RESOURCE_ADC_GPIO35_PIN
    { "adc.GPIO35", HYP_RESOURCE_ADC_GPIO35_PIN },
#endif
#ifdef HYP_RESOURCE_ADC_GPIO36_PIN
    { "adc.GPIO36", HYP_RESOURCE_ADC_GPIO36_PIN },
#endif
#ifdef HYP_RESOURCE_ADC_GPIO39_PIN
    { "adc.GPIO39", HYP_RESOURCE_ADC_GPIO39_PIN },
#endif
    /* PWM resources (FW-P5) */
#ifdef HYP_RESOURCE_PWM_GPIO25_PIN
    { "pwm.GPIO25", HYP_RESOURCE_PWM_GPIO25_PIN },
#endif
#ifdef HYP_RESOURCE_PWM_GPIO26_PIN
    { "pwm.GPIO26", HYP_RESOURCE_PWM_GPIO26_PIN },
#endif
#ifdef HYP_RESOURCE_PWM_GPIO27_PIN
    { "pwm.GPIO27", HYP_RESOURCE_PWM_GPIO27_PIN },
#endif
#ifdef HYP_RESOURCE_PWM_GPIO32_PIN
    { "pwm.GPIO32", HYP_RESOURCE_PWM_GPIO32_PIN },
#endif
#ifdef HYP_RESOURCE_PWM_GPIO33_PIN
    { "pwm.GPIO33", HYP_RESOURCE_PWM_GPIO33_PIN },
#endif
    /* GPIO resources (FW-P1) */
#ifdef HYP_RESOURCE_GPIO_GPIO0_PIN
    { "gpio.GPIO0",  HYP_RESOURCE_GPIO_GPIO0_PIN  },
#endif
#ifdef HYP_RESOURCE_GPIO_GPIO1_PIN
    { "gpio.GPIO1",  HYP_RESOURCE_GPIO_GPIO1_PIN  },
#endif
#ifdef HYP_RESOURCE_GPIO_GPIO2_PIN
    { "gpio.GPIO2",  HYP_RESOURCE_GPIO_GPIO2_PIN  },
#endif
#ifdef HYP_RESOURCE_GPIO_GPIO3_PIN
    { "gpio.GPIO3",  HYP_RESOURCE_GPIO_GPIO3_PIN  },
#endif
#ifdef HYP_RESOURCE_GPIO_GPIO4_PIN
    { "gpio.GPIO4",  HYP_RESOURCE_GPIO_GPIO4_PIN  },
#endif
#ifdef HYP_RESOURCE_GPIO_GPIO5_PIN
    { "gpio.GPIO5",  HYP_RESOURCE_GPIO_GPIO5_PIN  },
#endif
#ifdef HYP_RESOURCE_GPIO_GPIO12_PIN
    { "gpio.GPIO12", HYP_RESOURCE_GPIO_GPIO12_PIN },
#endif
#ifdef HYP_RESOURCE_GPIO_GPIO13_PIN
    { "gpio.GPIO13", HYP_RESOURCE_GPIO_GPIO13_PIN },
#endif
#ifdef HYP_RESOURCE_GPIO_GPIO14_PIN
    { "gpio.GPIO14", HYP_RESOURCE_GPIO_GPIO14_PIN },
#endif
#ifdef HYP_RESOURCE_GPIO_GPIO15_PIN
    { "gpio.GPIO15", HYP_RESOURCE_GPIO_GPIO15_PIN },
#endif
#ifdef HYP_RESOURCE_GPIO_GPIO16_PIN
    { "gpio.GPIO16", HYP_RESOURCE_GPIO_GPIO16_PIN },
#endif
#ifdef HYP_RESOURCE_GPIO_GPIO17_PIN
    { "gpio.GPIO17", HYP_RESOURCE_GPIO_GPIO17_PIN },
#endif
#ifdef HYP_RESOURCE_GPIO_GPIO18_PIN
    { "gpio.GPIO18", HYP_RESOURCE_GPIO_GPIO18_PIN },
#endif
#ifdef HYP_RESOURCE_GPIO_GPIO19_PIN
    { "gpio.GPIO19", HYP_RESOURCE_GPIO_GPIO19_PIN },
#endif
#ifdef HYP_RESOURCE_GPIO_GPIO21_PIN
    { "gpio.GPIO21", HYP_RESOURCE_GPIO_GPIO21_PIN },
#endif
#ifdef HYP_RESOURCE_GPIO_GPIO22_PIN
    { "gpio.GPIO22", HYP_RESOURCE_GPIO_GPIO22_PIN },
#endif
#ifdef HYP_RESOURCE_GPIO_GPIO23_PIN
    { "gpio.GPIO23", HYP_RESOURCE_GPIO_GPIO23_PIN },
#endif
#ifdef HYP_RESOURCE_GPIO_GPIO25_PIN
    { "gpio.GPIO25", HYP_RESOURCE_GPIO_GPIO25_PIN },
#endif
#ifdef HYP_RESOURCE_GPIO_GPIO26_PIN
    { "gpio.GPIO26", HYP_RESOURCE_GPIO_GPIO26_PIN },
#endif
#ifdef HYP_RESOURCE_GPIO_GPIO27_PIN
    { "gpio.GPIO27", HYP_RESOURCE_GPIO_GPIO27_PIN },
#endif
#ifdef HYP_RESOURCE_GPIO_GPIO32_PIN
    { "gpio.GPIO32", HYP_RESOURCE_GPIO_GPIO32_PIN },
#endif
#ifdef HYP_RESOURCE_GPIO_GPIO33_PIN
    { "gpio.GPIO33", HYP_RESOURCE_GPIO_GPIO33_PIN },
#endif
#ifdef HYP_RESOURCE_GPIO_GPIO34_PIN
    { "gpio.GPIO34", HYP_RESOURCE_GPIO_GPIO34_PIN },
#endif
#ifdef HYP_RESOURCE_GPIO_GPIO35_PIN
    { "gpio.GPIO35", HYP_RESOURCE_GPIO_GPIO35_PIN },
#endif
#ifdef HYP_RESOURCE_GPIO_GPIO36_PIN
    { "gpio.GPIO36", HYP_RESOURCE_GPIO_GPIO36_PIN },
#endif
#ifdef HYP_RESOURCE_GPIO_GPIO39_PIN
    { "gpio.GPIO39", HYP_RESOURCE_GPIO_GPIO39_PIN },
#endif
    { NULL, -1 } /* sentinel */
};

/**
 * get_pin_for_resource — look up the GPIO pin for a fully-qualified resource ID.
 *
 * resource_id format: "<type>.<instance>"  e.g. "adc.GPIO32", "pwm.GPIO25",
 * "gpio.GPIO4".
 *
 * Returns the GPIO pin number from the compile-time table, or -1 if the
 * resource is not configured in hyp_board_config.h.
 */
static int get_pin_for_resource(const char *resource_type, const char *instance) {
    if (!resource_type || !instance) return -1;
    /* Build fully-qualified key: "<type>.<instance>" on the stack */
    char key[64];
    snprintf(key, sizeof(key), "%s.%s", resource_type, instance);
    for (int i = 0; hyp_resource_pin_table[i].resource_id != NULL; i++) {
        if (strcmp(hyp_resource_pin_table[i].resource_id, key) == 0) {
            return hyp_resource_pin_table[i].pin;
        }
    }
    Serial.print("[WARN] get_pin_for_resource: no configured pin for ");
    Serial.println(key);
    return -1; /* resource not configured in board config */
}

/* Resource instance names are canonicalized at the boundary.  Existing board
 * configurations use both legacy uppercase bus names (for example, UART0)
 * and generated lowercase IDs (uart0); accepting either spelling preserves
 * those IDs while keeping all runtime lookups consistent. */
static bool canonical_instance_equals(const char *actual, const char *expected) {
    if (!actual || !expected) return false;
    while (*actual && *expected) {
        char actual_lower = (*actual >= 'A' && *actual <= 'Z') ? (char)(*actual - 'A' + 'a') : *actual;
        char expected_lower = (*expected >= 'A' && *expected <= 'Z') ? (char)(*expected - 'A' + 'a') : *expected;
        if (actual_lower != expected_lower) return false;
        ++actual;
        ++expected;
    }
    return *actual == '\0' && *expected == '\0';
}

/* Bus resources do not map to one GPIO. Resolve their existence from the
 * generated board configuration before attempting an operation. */
static bool is_configured_bus_resource(const char *resource_type, const char *instance) {
    if (!resource_type || !instance) return false;
    if (strcmp(resource_type, "uart") == 0) {
#ifdef HYP_RESOURCE_UART_UART0
        if (canonical_instance_equals(instance, "uart0")) return true;
#endif
#ifdef HYP_RESOURCE_UART_UART1
        if (canonical_instance_equals(instance, "uart1")) return true;
#endif
#ifdef HYP_RESOURCE_UART_UART2
        if (canonical_instance_equals(instance, "uart2")) return true;
#endif
        return false;
    }
    if (strcmp(resource_type, "spi") == 0) {
#ifdef HYP_RESOURCE_SPI_HSPI
        if (canonical_instance_equals(instance, "hspi")) return true;
#endif
#ifdef HYP_RESOURCE_SPI_VSPI
        if (canonical_instance_equals(instance, "vspi")) return true;
#endif
        return false;
    }
    if (strcmp(resource_type, "i2c") == 0) {
#ifdef HYP_RESOURCE_I2C_I2C0
        if (canonical_instance_equals(instance, "i2c0")) return true;
#endif
        return false;
    }
    return false;
}

static HardwareSerial *serial_for_resource(const char *instance) {
    if (canonical_instance_equals(instance, "uart0")) return &Serial;
    if (canonical_instance_equals(instance, "uart1")) return &Serial1;
    if (canonical_instance_equals(instance, "uart2")) return &Serial2;
    return NULL;
}

