Sohan-Chitluri/HyprAccel/sdk/src/hyp_esp32_hw.cpp
    if (is_write) {
        Wire.beginTransmission(dev_addr);
        Wire.write(reg_addr);
        Wire.write(data, len);
        uint8_t rc = Wire.endTransmission();
        if (rc != 0) {
            Serial.print("[ERROR] hyp_i2c_transact write NACK/timeout rc=");
            Serial.println(rc);
            return HYP_RUNTIME_IO_ERROR;
        }
        return HYP_RUNTIME_OK;
    }

    /* Register read: address the register, issue a repeated start, then read. */
    Wire.beginTransmission(dev_addr);
    Wire.write(reg_addr);
    uint8_t rc = Wire.endTransmission(false); /* false = repeated start (no STOP) */
    if (rc != 0) {
        Serial.print("[ERROR] hyp_i2c_transact reg-select NACK/timeout rc=");
        Serial.println(rc);
        return HYP_RUNTIME_IO_ERROR;
    }
    size_t got = Wire.requestFrom((int)dev_addr, (int)len);
    if (got != len) {
        Serial.println("[ERROR] hyp_i2c_transact read short/timeout");
        return HYP_RUNTIME_IO_ERROR;
    }
    for (size_t i = 0; i < len; i++) data[i] = (uint8_t)Wire.read();
    return HYP_RUNTIME_OK;
#endif
}

uint32_t hyp_esp32_timestamp_us(void) {
    return (uint32_t)micros();
}

int hyp_esp32_sensor_read(const char *resource_id, void *out_value, uint32_t value_size) {
    if (!resource_id || !out_value || value_size == 0) {
        return HYP_RUNTIME_INVALID_ARGUMENT;
    }
    
    char resource_type[32];
    char instance[64];
    
    if (parse_resource_id(resource_id, resource_type, sizeof(resource_type), 
                          instance, sizeof(instance)) != 0) {
        return HYP_RUNTIME_INVALID_RESOURCE_ID;
    }
    
    // Handle different sensor types
    if (strcmp(resource_type, "adc") == 0) {
        // ADC read - returns 12-bit value (0-4095) or voltage
        int pin = get_pin_for_resource(resource_type, instance);
        if (pin < 0) return HYP_RUNTIME_RESOURCE_NOT_CONFIGURED;
        
        if (value_size == sizeof(uint16_t)) {
            uint16_t *out = (uint16_t *)out_value;
            *out = analogRead(pin);
            return 0;
        } else if (value_size == sizeof(float)) {
            float *out = (float *)out_value;
            uint16_t raw = analogRead(pin);
            // Convert to voltage (assuming 3.3V reference, 12-bit ADC)
            *out = (raw * 3.3f) / 4095.0f;
            return 0;
        }
        return HYP_RUNTIME_BUFFER_TOO_SMALL;
    }
    
    if (strcmp(resource_type, "gpio") == 0) {
        // Digital GPIO read - returns boolean (0 or 1)
        int pin = get_pin_for_resource(resource_type, instance);
        if (pin < 0) return HYP_RUNTIME_RESOURCE_NOT_CONFIGURED;
        
        if (value_size == sizeof(uint8_t)) {
            uint8_t *out = (uint8_t *)out_value;
            *out = digitalRead(pin) ? 1 : 0;
            return 0;
        }
        if (value_size == sizeof(float)) {
            float *out = (float *)out_value;
            *out = digitalRead(pin) ? 1.0f : 0.0f;
            return HYP_RUNTIME_OK;
        }
        return HYP_RUNTIME_BUFFER_TOO_SMALL;
    }
    
    if (strcmp(resource_type, "uart") == 0) {
        if (!is_configured_bus_resource(resource_type, instance)) {
            return HYP_RUNTIME_RESOURCE_NOT_CONFIGURED;
        }
        HardwareSerial *serial = serial_for_resource(instance);
        if (!serial) return HYP_RUNTIME_UNSUPPORTED_INSTANCE;
        // Report bytes currently available; this primitive does not consume data.
        if (value_size == sizeof(int)) {
            int *out = (int *)out_value;
            *out = serial->available();
            return HYP_RUNTIME_OK;
        }
        if (value_size == sizeof(float)) {
            float *out = (float *)out_value;
            *out = (float)serial->available();
            return HYP_RUNTIME_OK;
        }
        return HYP_RUNTIME_BUFFER_TOO_SMALL;
    }

    if (strcmp(resource_type, "spi") == 0) {
        /* Full-duplex read: clock out zeros and capture the received bytes.
         * hyp_spi_transfer validates configuration and initialization state. */
        return hyp_spi_transfer(resource_id, NULL, (uint8_t *)out_value, value_size);
    }

    if (strcmp(resource_type, "i2c") == 0) {
        /* Register-less read of value_size bytes from the named device. Callers
         * needing register-addressed access use hyp_i2c_transact() directly. */
        uint8_t dev_addr = 0;
        if (i2c_address_for_device(instance, &dev_addr) != 0) {
            return HYP_RUNTIME_RESOURCE_NOT_CONFIGURED;
        }
        return i2c_raw_transfer(dev_addr, (uint8_t *)out_value, value_size, false);
    }

    return HYP_RUNTIME_UNSUPPORTED_RESOURCE;
}

int hyp_esp32_actuator_write(const char *resource_id, const void *in_value, uint32_t value_size) {
    if (!resource_id || !in_value || value_size == 0) {
        return HYP_RUNTIME_INVALID_ARGUMENT;
    }
    
    char resource_type[32];
    char instance[64];
    
    if (parse_resource_id(resource_id, resource_type, sizeof(resource_type),
                          instance, sizeof(instance)) != 0) {
        return HYP_RUNTIME_INVALID_RESOURCE_ID;
    }
    
    // Handle different actuator types
    if (strcmp(resource_type, "pwm") == 0) {
        // PWM write - expects duty cycle (0-65535 for 16-bit, or 0-255 for 8-bit)
        int pin = get_pin_for_resource(resource_type, instance);
        if (pin < 0) return HYP_RUNTIME_RESOURCE_NOT_CONFIGURED;
        
        if (value_size == sizeof(uint16_t)) {
            uint16_t duty = *(const uint16_t *)in_value;
#if defined(ESP_ARDUINO_VERSION_MAJOR) && ESP_ARDUINO_VERSION_MAJOR >= 3
            ledcWrite(pin, duty);
#else
            // Need to find the channel for this pin - simplified for now
            // In reality we'd need a pin->channel mapping
            ledcWrite(pin, duty); // This won't work on older Arduino cores without channel
#endif
            return 0;
        } else if (value_size == sizeof(float)) {
            // Accept float 0.0-1.0 as duty cycle fraction
            float duty_frac = *(const float *)in_value;
            if (duty_frac < 0.0f || duty_frac > 1.0f) return HYP_RUNTIME_INVALID_ARGUMENT;
            uint16_t duty = (uint16_t)(duty_frac * 65535.0f);
#if defined(ESP_ARDUINO_VERSION_MAJOR) && ESP_ARDUINO_VERSION_MAJOR >= 3
            ledcWrite(pin, duty);
#endif
            return 0;
        }
        return HYP_RUNTIME_BUFFER_TOO_SMALL;
    }
    
    if (strcmp(resource_type, "gpio") == 0) {
        // Digital GPIO write - expects boolean (0 or 1)
        int pin = get_pin_for_resource(resource_type, instance);
        if (pin < 0) return HYP_RUNTIME_RESOURCE_NOT_CONFIGURED;
        
        if (value_size == sizeof(uint8_t)) {
            uint8_t val = *(const uint8_t *)in_value;
            digitalWrite(pin, val ? HIGH : LOW);
            return 0;
        }
        if (value_size == sizeof(float)) {
            float value = *(const float *)in_value;
            if (value != 0.0f && value != 1.0f) return HYP_RUNTIME_INVALID_ARGUMENT;
            digitalWrite(pin, value != 0.0f ? HIGH : LOW);
            return HYP_RUNTIME_OK;
        }
        return HYP_RUNTIME_BUFFER_TOO_SMALL;
    }
    
    if (strcmp(resource_type, "uart") == 0) {
        if (!is_configured_bus_resource(resource_type, instance)) {
            return HYP_RUNTIME_RESOURCE_NOT_CONFIGURED;
        }
        HardwareSerial *serial = serial_for_resource(instance);
        if (!serial) return HYP_RUNTIME_UNSUPPORTED_INSTANCE;
        serial->write((const uint8_t *)in_value, value_size);
        return HYP_RUNTIME_OK;
    }

    if (strcmp(resource_type, "spi") == 0) {
        /* Full-duplex write: clock out the supplied bytes, discard received. */
        return hyp_spi_transfer(resource_id, (const uint8_t *)in_value, NULL, value_size);
    }

    if (strcmp(resource_type, "i2c") == 0) {
        /* Register-less write of value_size bytes to the named device. */
        uint8_t dev_addr = 0;
        if (i2c_address_for_device(instance, &dev_addr) != 0) {
            return HYP_RUNTIME_RESOURCE_NOT_CONFIGURED;
        }
        return i2c_raw_transfer(dev_addr, (uint8_t *)in_value, value_size, true);
    }

    return HYP_RUNTIME_UNSUPPORTED_RESOURCE;
}
